# f(x) = -12x^4*sin(cos(x)) - 18x^3+5x^2 + 10x - 30
# Определить корни                                      +
# Найти интервалы, на которых функция возрастает        +
# Найти интервалы, на которых функция убывает           +
# Построить график                                      +

# Вычислить вершину                                     +
# Определить промежутки, на котором f > 0               +
# Определить промежутки, на котором f < 0               +


a,b,c,d,e = -12,-18,5,10,-30
range_start = -20
range_end = 20
step = 0.01